# GetEnumerator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSizeSettings..::..GetEnumerator Method
ConduitSizeSettings Class See Also
---
Returns an enumerator that iterates through a collection.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual IEnumerator<KeyValuePair<string, ConduitSizes>> GetEnumerator()
```

Visual Basic
---
```text
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of String, ConduitSizes))
```

Visual C++
---
```text
public:
virtual IEnumerator<KeyValuePair<String^, ConduitSizes^>>^ GetEnumerator()
```

# ### Return Value
An IEnumerator object that can be used to iterate through the collection.
# ### Implements
IEnumerable<(Of <(<'T>)>)>..::..GetEnumerator()()()()
# See Also
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace